# OwnerInfo Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..OwnerInfo Property
TessellatedShapeBuilder Class See Also
---
String used for logging, if any. Usually describes the element or object, which either defined or will own the geoemtrical objects to be built.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string OwnerInfo { get; set; }
```

Visual Basic
---
```text
Public Property OwnerInfo As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ OwnerInfo {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace